// questions.js
export const dictionary = {
    "たべもの": [
        "おむらいす", "めろんぱん", "そふとくりーむ", "たこやき", "かれーらいす",
        "てんぷらそば", "はんばーぐ", "さんどいっち", "ぎょうざ", "おこのみやき",
        "ほっとどっぐ", "ぺぺろんちーの", "ちーずふぉんでゅ", "びびんば", "なぽりたん",
        "みそらーめん", "まーぼーどうふ", "えびふらい", "きつねうどん", "おにぎり"
    ],
    "どうぶつ": [
        "らいおん", "ちんぱんじー", "はむすたー", "かんがるー", "ぺんぎん",
        "ふらみんご", "かぴばら", "かめれおん", "しまうま", "れっさーぱんだ",
        "こあら", "ありくい", "はくちょう", "もるもっと", "ちーたー",
        "ほっきょくぐま", "にほんざる", "だちょう", "ごりら", "わに"
    ],
    "のりもの": [
        "しんかんせん", "へりこぷたー", "きゅうきゅうしゃ", "しょうぼうしゃ", "ぱとかー",
        "ろけっと", "しょべるかー", "さんりんしゃ", "きゃんぴんぐかー", "よっと",
        "じぇっとき", "もんすたーとらっく", "さぶまりん", "ぶるどーざー", "ごみししゅうしゅうしゃ",
        "ばす", "たくしー", "じてんしゃ", "けーぶるかー", "ろーぷうぇい"
    ],
    "ポケモン": [
        // 剣盾（ガラル地方）までの人気ポケモンを厳選
        "ぴかちゅう", "りざーどん", "いーぶい", "げっこうが", "みゅうつー",
        "るかりお", "げんがー", "ぽっちゃま", "がぶりあす", "さーないと",
        "れっくうざ", "るぎあ", "ほうおう", "でぃあるが", "ぱるきあ",
        "だーくい", "あるせうす", "ぜらおら", "えーすばーん", "いんてれおん",
        "ごりらんだー", "あーまーがあ", "すとりんだー", "どらぱると", "まほいっぷ",
        "わんぱち", "もるぺこ", "ざしあん", "ざまぜんた", "むげんだいな",
        "うーらおす", "れじえれき", "れじどらご", "ぶりざぽす", "れいすぽす",
        "ばどれっくす", "ふらいごん", "ぼーまんだ", "めたぐろす", "ばんぎらす"
    ],
    "ちめい": [
        "とうきょう", "おおさか", "ほっかいどう", "おきなわ", "ふじさん",
        "しんじゅく", "よこはま", "なごや", "きょうと", "ふくおか",
        "さっぽろ", "ひろしま", "せんだい", "かなざわ", "ならこうえん",
        "あきた", "くまもと", "ながさき", "かごしま", "あおもり",
        "しぶや", "あきはばら", "ろっぽんぎ", "あさくさ", "おだいば"
    ],
    "オールジャンル": []
};

dictionary["オールジャンル"] = [].concat(...Object.values(dictionary));
